# Отчёт по лабораторной работе №14 по курсам “Основы информатики” и "Программно-аппаратные средства информатики"

<b>Студент группы:</b> <ins>М80-108Б-22 Формалёв Александр Сергеевич, № по списку 21</ins> 

<b>Контакты e-mail:</b> <ins>lyadiez@mail.ru</ins>

<b>Работа выполнена:</b> «30» <ins>ноября</ins> <ins>2022</ins> г.

<b>Преподаватель:</b> <ins>асп. каф. 806 Сахарин Никита Александрович</ins>

<b>Входной контроль знаний с оценкой:</b> <ins> </ins>

<b>Отчет сдан</b> «3» <ins>декабря</ins> <ins>2022</ins> г., <b>итоговая оценка</b> <ins> </ins>

<b>Подпись преподавателя:</b> ________________


## 1. Тема
Вложенные циклы с параметрами. Обход и линеаризация матриц.

## 2. Цель работы
Составить программу ввода квадратной матрицы и печати в строку всех её элементов в заданном вариантом порядке следования на языке Си.

## 3. Задание (вариант № 20)

Вывести матрицу согласно таблице:

| 13 | 12 | 11 | 10 |
| ------ | ------ | ------ | ------ |
| 14 | 7 | 8 | 9 |
| 15 | 6 | 3 | 2 |
| 16 | 5 | 4 | 1 |

## 4. Оборудование:

<b>Процессор:</b> AMD A9-9425 RADEON R5, 5 COMPUTE CORES 2C+3G 3.10 GHz <br/>

<b>ОП:</b> 8 ГБ <br/>

<b>SSD:</b> 256 ГБ<br/>

<b>Монитор:</b> 1920 х 1080 <br/>

## 5. Программное обеспечение:
<b>Операционная система семейства:</b> Ubuntu 22.04.01 LTS<br/>

<b>Интерпретатор команд:</b> bash версия 4.4.19<br/>

<b>Система программирования:</b> не использовалась версия —<br/>

<b>Редактор текстов:</b> VS Code

<b>Утилиты операционной системы:</b> -

<b>Прикладные системы и программы:</b> -

<b>Местонахождение и имена файлов программ и данных на домашнем компьютере:</b>

## 6. Идея, метод, алгоритм решения задачи (в формах: словесной, псевдокода, графической [блок-схема, диаграмма, рисунок, таблица] или формальные спецификации с пред- и постусловиями)

• Разобраться с поставленной задачей

• Найти решение с помощью программы на языке С

• Скомпилировать программу

• Запустить программу

## 7. Сценарий выполнения работы [план работы, первоначальный текст программы в черновике (можно на отдельном листе) и тесты либо соображения по тестированию]. 

```
#include <stdio.h>

int main (){
    int massive [7][7];
    int n;
    scanf ("%d", &n);
    for(int i = 0;i!=n;++i)
        for (int j = 0; j != n; ++j)
            scanf ("%d", &massive[i][j]);

    typedef enum{
        STATE_BY_LINE,
        STATE_BY_COLUMN
    } State;

    int i = n - 1, j = n - 1, p = 1;
    State state = STATE_BY_LINE;

    while(p <= n){
        for(int count_elem = 1; count_elem != 2 * p; count_elem++){
            printf("%d ", massive[i][j]);
            if(i == j){
                if (state == STATE_BY_LINE){
                    state = STATE_BY_COLUMN;
                } else{
                    state = STATE_BY_LINE;
                }
            }
            if (p % 2 == 0){
                if(state == STATE_BY_LINE){
                    j -= 1;
                } else if(state == STATE_BY_COLUMN){
                    i++;
                }
            } else{
                if(state == STATE_BY_LINE){
                    j++;
                } else if(state == STATE_BY_COLUMN){
                    i -= 1;
                }
            }
        }
        p += 1;
        if (p % 2 == 0){
            i = n - p;
            j = n - 1;
            state = STATE_BY_LINE;
        } else {
            i = n - 1;
            j = n - p;
            state = STATE_BY_COLUMN;
        }
    }
    putchar('\n');
    return 0;
}
```

Пункты 1-7 отчета составляются сторого до начала лабораторной работы.
Допущен к выполнению работы.  
Подпись преподавателя _____________________
## 8. Распечатка протокола 

```
demagog@demagog-VivoBook-ASUSLaptop-X509BA-D509BA:~/Загрузки$ ./"laba14"
1
11
11 
demagog@demagog-VivoBook-ASUSLaptop-X509BA-D509BA:~/Загрузки$ 
demagog@demagog-VivoBook-ASUSLaptop-X509BA-D509BA:~/Загрузки$ ./"laba14"
3
11
12
13
21
22
23
31
32
33
33 23 22 32 31 21 11 12 13 
demagog@demagog-VivoBook-ASUSLaptop-X509BA-D509BA:~/Загрузки$ ./"laba14"
4
11
12
13
14
21
22
23
24
31
32
33
34
41
42
43
44
44 34 33 43 42 32 22 23 24 14 13 12 11 21 31 41 
demagog@demagog-VivoBook-ASUSLaptop-X509BA-D509BA:~/Загрузки$ ./"laba14"
5
11
12
13
14
15
21
22
23
24
25
31
32
33
34
35
41
42
43
44
45
51
52
53
54
55
55 45 44 54 53 43 33 34 35 25 24 23 22 32 42 52 51 41 31 21 11 12 13 14 15 
demagog@demagog-VivoBook-ASUSLaptop-X509BA-D509BA:~/Загрузки$ 
```

## 9. Дневник отладки должен содержать дату и время сеансов отладки и основные события (ошибки в сценарии и программе, нестандартные ситуации) и краткие комментарии к ним. В дневнике отладки приводятся сведения об использовании других ЭВМ, существенном участии преподавателя и других лиц в написании и отладке программы.

| № |  Лаб. или дом. | Дата | Время | Событие | Действие по исправлению | Примечание |
| ------ | ------ | ------ | ------ | ------ | ------ | ------ |
| 1 | дом. | 30.11.22 | 18:00 | Выполнение лабораторной работы | - | - |

## 10. Замечания автора по существу работы — Написание команд для отработки навыков работы в ОС UNIX.

Для защиты лабораторной работы было предложено задание: вывести матрицу согласно таблице

| 1 | 2 | 5 | 6 | 17 | 18 | 21 | 22 |
| ------ | ------ | ------ | ------ | ------ | ------ | ------ | ------ |
| 3 | 4 | 7 | 8 | 19 | 20 | 23 | 24 |
| 9 | 10 | 13 | 14 | 25 | 26 | 29 | 30 |
| 11 | 12 | 15 | 16 | 27 | 28 | 31 | 32 |
| 33 | 34 | 37 | 38 | 49 | 50 | 53 | 54 |
| 35 | 36 | 39 | 40 | 51 | 52 | 55 | 56 |
| 41 | 42 | 45 | 46 | 57 | 58 | 61 | 62 |
| 43 | 44 | 47 | 48 | 59 | 60 | 63 | 64 |

```
#include <stdio.h>

void input_matrix(int n, int (*massive)[n]){
    for(int i = 0;i!=n;++i){
        for (int j = 0; j != n; ++j){
            scanf ("%02d", &massive[i][j]);
        }
    }
}

void print_Z(int n, int (*massive)[n], int i, int j){
    if ((i < n) && (j < n)){
        printf("%02d ", massive[i][j]);
    }
    if (j + 1 < n){
        printf("%02d ", massive[i][j + 1]);
    }
    if (i + 1 < n){
        printf("%02d ", massive[i + 1][j]);
    }
    if ((j + 1 < n) && (i + 1 < n)){
        printf("%02d ", massive[i + 1][j + 1]);
    }
}

void print_many_Z(int n, int i, int j, int maxstep, int (*massive)[n]){
    if (maxstep == 1){
        print_Z(n, massive, i, j);
    } else{
        print_many_Z(n, i, j, maxstep - 1, massive);
        print_many_Z(n, i, j + power(2, maxstep - 1), maxstep - 1, massive);
        print_many_Z(n, i + power(2, maxstep - 1), j, maxstep - 1, massive);
        print_many_Z(n, i + power(2, maxstep - 1), j + power(2, maxstep - 1), maxstep - 1, massive);
    }
}

int max_step(int n){
    int st = 1;
    while (n > power(2, st)){
        st++;
    }
    return st;
}

int power(int a, int b){
    int c = 1;
    for (int i = 0; i < b; i++){
        c *= a;
    }
    return c;
}

int main(){
    int n;
    scanf ("%d", &n);
    int massive[n * n];
    input_matrix(n,  massive);
    int maxstep = max_step(n);
    print_many_Z(n, 0, 0, maxstep, massive);
    putchar('\n');
    return 0;
}
```

## 11. Выводы

Были приобретены навыки обработки матриц и их вывода в одну стоку согласно определённым правилам на языке Си.

Недочёты при выполнении задания могут быть устранены следующим образом: —

Подпись студента _________________


