# Отчёт по лабораторной работе №11 по курсам “Основы информатики” и "Программно-аппаратные средства информатики"

<b>Студент группы:</b> <ins>М80-108Б-22 Формалёв Александр Сергеевич, № по списку 21</ins> 

<b>Контакты e-mail:</b> <ins>lyadiez@mail.ru</ins>

<b>Работа выполнена:</b> «9» <ins>ноября</ins> <ins>2022</ins> г.

<b>Преподаватель:</b> <ins>асп. каф. 806 Сахарин Никита Александрович</ins>

<b>Входной контроль знаний с оценкой:</b> <ins> </ins>

<b>Отчет сдан</b> «17» <ins>ноября</ins> <ins>2022</ins> г., <b>итоговая оценка</b> <ins> </ins>

<b>Подпись преподавателя:</b> ________________


## 1. Тема
Техника работы с целыми числами.

## 2. Цель работы
Составить программу на языке Си, выполняющую анализ и обработку вводимого текста и работающую без ограничений на количество и длину строк исходного текста.

## 3. Задание (вариант № 4)
Перевести все мерные расстояния из миль в километры.

## 4. Оборудование:

<b>Процессор:</b> AMD A9-9425 RADEON R5, 5 COMPUTE CORES 2C+3G 3.10 GHz <br/>

<b>ОП:</b> 8 ГБ <br/>

<b>SSD:</b> 256 ГБ<br/>

<b>Монитор:</b> 1920 х 1080 <br/>

## 5. Программное обеспечение:
<b>Операционная система семейства:</b> VirtualBox 6.1.38 - Ubuntu 22.04.01 LTS<br/>

<b>Интерпретатор команд:</b> bash версия 4.4.19<br/>

<b>Система программирования:</b> не использовалась версия —<br/>

<b>Редактор текстов:</b> -

<b>Утилиты операционной системы:</b> -

<b>Прикладные системы и программы:</b> -

<b>Местонахождение и имена файлов программ и данных на домашнем компьютере:</b>

## 6. Идея, метод, алгоритм решения задачи (в формах: словесной, псевдокода, графической [блок-схема, диаграмма, рисунок, таблица] или формальные спецификации с пред- и постусловиями)
• Разобраться с поставленной задачей

• Найти решение с помощью программы на языке С

•	Скомпилировать программу

•	Запустить программу

## 7. Сценарий выполнения работы [план работы, первоначальный текст программы в черновике (можно на отдельном листе) и тесты либо соображения по тестированию]. 
```
#include <stdio.h>
int main(){
    int flag = 1;
    int num = 0;
    char ch;
    ch = getchar();
    while (ch != EOF){
        if (('0' <= ch) && (ch <= '9')){
            if (flag == 0){
                putchar(ch);
            } else{
            num = 10 * num + (ch - '0');
            flag = 2;
            }
        } else if((ch != '\n') && (ch != ' ')){
            if (flag == 2){
                printf("%d", num);
                num = 0;
            }
            flag = 0;
            putchar(ch);
        } else{
            if (flag == 2){
                if (ch == '\n'){
                printf("%d\n", (int)(num * 1.609));
                } else{
                    printf("%d ", (int)(num * 1.609));
                }
            } else{
                if (ch == '\n'){
                printf("\n");
                } else{
                    printf(" ");
                } 
            }
            flag = 1;
            num = 0;
        }
        ch = getchar();
    }
    printf("\n");
}
```

Пункты 1-7 отчета составляются сторого до начала лабораторной работы.
Допущен к выполнению работы.  
Подпись преподавателя _____________________
## 8. Распечатка протокола 
```
demagog@demagog-VivoBook-ASUSLaptop-X509BA-D509BA:~/Загрузки$ gcc laba11.c
demagog@demagog-VivoBook-ASUSLaptop-X509BA-D509BA:~/Загрузки$ ./a.out << EOF
> 1000
> 1000 sdkjf
> 1000lskdf sdklfj1000 1000dskjf10fjk3
> 1
> 0
> skdfjl
> !
> EOF
1609
1609 sdkjf
1000lskdf sdklfj1000 1000dskjf10fjk3
1
0
skdfjl
!
```
## 9. Дневник отладки должен содержать дату и время сеансов отладки и основные события (ошибки в сценарии и программе, нестандартные ситуации) и краткие комментарии к ним. В дневнике отладки приводятся сведения об использовании других ЭВМ, существенном участии преподавателя и других лиц в написании и отладке программы.

| № |  Лаб. или дом. | Дата | Время | Событие | Действие по исправлению | Примечание |
| ------ | ------ | ------ | ------ | ------ | ------ | ------ |
| 1 | дом. | 09.11.22 | 18:00 | Выполнение лабораторной работы | - | - |
## 10. Замечания автора по существу работы — Написание команд для отработки навыков работы в ОС UNIX.
```

```
## 11. Выводы
Были приобретены навыки написания программ, анализирующих и обрабатывающих входные данные и работающих все зависимости от длины входного слова и количества строк, на языке Си. Изучена работа функций getchar и putchar.

Недочёты при выполнении задания могут быть устранены следующим образом: —

Подпись студента _________________


